packages/artillery-tests/src/fhir/batch/load-hapi.yml
config:
  target: "{{ $processEnvironment.HAPI_URL }}"
  http:
    timeout: 120
  plugins:
    # https://www.artillery.io/docs/guides/plugins/plugin-publish-metrics
    publish-metrics:
      - type: cloudwatch
        region: "{{ $processEnvironment.REGION }}"
    # https://www.artillery.io/docs/guides/plugins/plugin-metrics-by-endpoint
    metrics-by-endpoint:
      # Group metrics by request name rather than URL:
      useOnlyRequestNames: true
  phases:
    # 2 users, one every 3 seconds
    - duration: 6
      arrivalCount: 2
      name: Warm up
    # 12 users, one every 5 seconds
    - duration: 60
      arrivalRate: 12
      rampTo: 50
      name: Ramp up load
  variables:
    tenantId: "{{ $processEnvironment.HAPI_TENANT_ID }}"
  processor: "./batch.js"

scenarios:
  - name: "FHIR Batch HAPI Load"
    beforeScenario: makeBodyRandom
    flow:
      # - log: "Posting batch {{ requestFile }}"
      - post:
          url: "/fhir/{{ tenantId }}/"
          json: "{{ requestBody }}"
          name: "POST Batch"